#include <stdio.h>
#include <string.h>

int main() 
{
    int num = 15; // 00000000 00000000 00000000 00001111
    
    int l_shift1 = num << 1; // 00000000 00000000 00000000 00011110
    int l_shift2 = num << 2; // 00000000 00000000 00000000 00111100
    int l_shift3 = num << 3; // 00000000 00000000 00000000 01111000
    
    printf("왼쪽으로 1칸 이동 : %d\n", l_shift1);
    printf("왼쪽으로 2칸 이동 : %d\n", l_shift2);
    printf("왼쪽으로 3칸 이동 : %d\n\n", l_shift3);
    
    int r_shift1 = num >> 1; // 00000111
    int r_shift2 = num >> 2; // 00000011
    int r_shift3 = num >> 3; // 00000001
    
    printf("오른쪽으로 1칸 이동 : %d\n", r_shift1);
    printf("오른쪽으로 2칸 이동 : %d\n", r_shift2);
    printf("오른쪽으로 3칸 이동 : %d\n\n", r_shift3);
    
    //주의할 점
    //MSB(가장 왼쪽 끝 비트)에 0을 채울수도 있고, 1을 채울 수도 있다.
    
    //간혹 >>연산시 0을 가져오는 CPU들도 있다.
    
    // 11110000 >> 1 했을때,
    // 01111000 로 나올 수 있다.
    
    num = -16; // 11111111 11111111 11111111 11110000
    int r1 = num >> 1; // 11111111 11111111 11111111 11111000
    int r2 = num >> 2; // 11111111 11111111 11111111 11111100
    int r3 = num >> 3; // 11111111 11111111 11111111 11111110
    
    printf("%d\n", r1);
    printf("%d\n", r2);
    printf("%d\n", r3);
    
    return 0;
}
